In [2]:
import pandas as pd
import numpy as np

Series do pandas

In [3]:
"Criando uma series"
serie_pandas = pd.Series(np.random.randn(5))
serie_pandas

0   -0.170531
1    1.178661
2   -0.024881
3    0.065512
4    1.398175
dtype: float64

In [4]:
series_indice = pd.Series(np.random.randn(5), index= ["A","B","C","D","E"])
series_indice

A    0.055399
B   -0.392380
C   -1.349311
D   -0.877084
E   -0.404155
dtype: float64

In [5]:
"""Também pode usar dicionarios para crianção de Series"""
d = {"A":2,"B":4,"C":5}
serie_d = pd.Series(d)

serie_d

A    2
B    4
C    5
dtype: int64

In [6]:
"""Se o valor passado for escalar, um indice deverá ser passado"""
pd.Series(10.0, index = ["A","B","C","D"])

A    10.0
B    10.0
C    10.0
D    10.0
dtype: float64

In [7]:
"""Series são semelhantes aos narrays do numpy"""
#acessar indice
display(serie_pandas[0])
#mostrar da linha 2 maior
display(serie_pandas[2:])
#valores acimada média
display(serie_pandas[serie_pandas > serie_pandas.median()])
#selecionar pelos indices
display(serie_pandas[[0,1,3]])

-0.17053071072522283

2   -0.024881
3    0.065512
4    1.398175
dtype: float64

1    1.178661
4    1.398175
dtype: float64

0   -0.170531
1    1.178661
3    0.065512
dtype: float64

In [8]:
#Podemos usar um dataframe como uma serie, quando quisermos trabalhar com uma coluna apenas
dicionario = {"A":(1,2,3,4,5),"B":(4,5,6,7,8),"C":(7,8,9,10,11)}
df_pandas = pd.DataFrame(dicionario)
display(df_pandas["B"][df_pandas["B"]>6])

#series
display(type(df_pandas["A"]))
#dataframe
display(type(df_pandas[["A","B"]]))

3    7
4    8
Name: B, dtype: int64

pandas.core.series.Series

pandas.core.frame.DataFrame

In [9]:
"""Series do pandas podem ter um tipo apenas"""
serie_pandas.dtype

dtype('float64')

In [10]:
"""Transformar em arrayPandas para analizar em o index"""
serie_pandas.array

<PandasArray>
[ -0.17053071072522283,     1.178661493810676, -0.024880582057821992,
   0.06551151423048851,    1.3981746305705167]
Length: 5, dtype: float64

In [11]:
"""Tranformar em numpy array"""
serie_pandas.to_numpy()

array([-0.17053071,  1.17866149, -0.02488058,  0.06551151,  1.39817463])

In [12]:
"""Series como dicionários"""
display("A" in series_indice)
display("Z" in series_indice)

True

False

In [13]:
"""metodo get, se o objeto nao for encontrado retorna o segundo parametro"""
series_indice.get("z", "Não encontrado")

'Não encontrado'

Atributo Nome

In [14]:
list_notas = np.random.randint(low = 0, high= 11, size = (10))
print(list_notas)

series_notas = pd.Series(list_notas, name = "JulioNotas")
display(series_notas)

#mudar o nome da series 
#tornando um objeto diferente
serie_2 = series_notas.rename("AlguemNotas")
serie_2

[9 5 6 1 1 9 4 0 1 8]

0    9
1    5
2    6
3    1
4    1
5    9
6    4
7    0
8    1
9    8
Name: JulioNotas, dtype: int32

0    9
1    5
2    6
3    1
4    1
5    9
6    4
7    0
8    1
9    8
Name: AlguemNotas, dtype: int32

DataFrame

In [15]:
"""Criando dataFrames através de Series, listas e dicionarios"""

#utilizando listas e dicionários
lista_a = ["Brasil","Bolivia","Paraguai"]
lista_b = ["Eua", "Mexico","Canada"]
lista_index = ["A","B","C"]


dataframe_paises = pd.DataFrame({"America Sul":lista_a,"America Norte":lista_b}, index= lista_index)
dataframe_paises

  America Sul America Norte
A      Brasil           Eua
B     Bolivia        Mexico
C    Paraguai        Canada

In [16]:
#Utilizando series 
serie_a = pd.Series(["São Paulo","Rio de Janeiro","Minas Gerais","Espirito Santos"], index = ["A","B","C","D"], name = "Sudeste")
serie_b = pd.Series(["Rio Grande do Sul","Santa Catarina", "Paraná"], index = ["A","B","C"], name = "Sul")

dataframe_estados = pd.DataFrame({serie_a.name:serie_a,serie_b.name:serie_b})

dataframe_estados

           Sudeste                Sul
A        São Paulo  Rio Grande do Sul
B   Rio de Janeiro     Santa Catarina
C     Minas Gerais             Paraná
D  Espirito Santos                NaN

In [17]:
#criar dataframe pelo index
pd.DataFrame(dataframe_estados, index = ["A","C"])

        Sudeste                Sul
A     São Paulo  Rio Grande do Sul
C  Minas Gerais             Paraná

In [18]:
#possivel selecionar as colunas também 
pd.DataFrame(dataframe_estados, index = ["A", "B"], columns= ["Sul","Não Existe"], dtype= "object")

                 Sul Não Existe
A  Rio Grande do Sul        NaN
B     Santa Catarina        NaN

In [19]:
"""Reorganizar colunas ou index"""
pd.DataFrame(dataframe_estados, columns=["Sul","Sudeste"], index = ["D","C","B","A"])

                 Sul          Sudeste
D                NaN  Espirito Santos
C             Paraná     Minas Gerais
B     Santa Catarina   Rio de Janeiro
A  Rio Grande do Sul        São Paulo

In [20]:
"""Construtores alternativos, Invertendo linhas e colunas"""

dicionario_dobro = dict([("A",[1,2,3,4]),("B",[2,4,6,8])])

pd.DataFrame.from_dict(dicionario_dobro, orient= "index", columns = ["One","Two","Three","Four"])

   One  Two  Three  Four
A    1    2      3     4
B    2    4      6     8

In [21]:
""" podemos inserir colunas pelo comando insert também"""

display(df_pandas)
d = [12,13,14,15,16]
d_df = pd.DataFrame({"D": d})

#Podemos usar listas, dicionários ou séries
df_pandas.insert(0,"D",d_df)
df_pandas.insert(1,"E",d)
df_pandas

   A  B   C
0  1  4   7
1  2  5   8
2  3  6   9
3  4  7  10
4  5  8  11

    D   E  A  B   C
0  12  12  1  4   7
1  13  13  2  5   8
2  14  14  3  6   9
3  15  15  4  7  10
4  16  16  5  8  11

In [22]:
"""Deletar colunas """

del df_pandas["E"]
#ou
df_pandas.pop("D")

df_pandas

   A  B   C
0  1  4   7
1  2  5   8
2  3  6   9
3  4  7  10
4  5  8  11

In [23]:
"""Metodo assing para adicionar colunas"""
#Não insere diretamente no dataframe, sempre retorna um copia
df_pandas.assign(F = df_pandas["A"] + df_pandas["B"] + df_pandas["C"])

   A  B   C   F
0  1  4   7  12
1  2  5   8  15
2  3  6   9  18
3  4  7  10  21
4  5  8  11  24

In [24]:
#exemplo com o uso do lambda
df_pandas.assign(G = lambda x : df_pandas["A"] ** 2,
                 H = lambda x: df_pandas["A"] ** 3)

   A  B   C   G    H
0  1  4   7   1    1
1  2  5   8   4    8
2  3  6   9   9   27
3  4  7  10  16   64
4  5  8  11  25  125

In [25]:
#exemplo de uso
df_pandas.query("A >= 3").assign(I = lambda x : df_pandas["A"] * df_pandas["B"] *df_pandas["C"])

   A  B   C    I
2  3  6   9  162
3  4  7  10  280
4  5  8  11  440

Indexing selection

In [37]:
# Não da erro quando trabalhamos com dimensões diferentes, mas os valores que nao existem em um dataframe são considerados null
df = pd.DataFrame(np.random.randn(10, 4), columns=["A", "B", "C", "D"])
df2 = pd.DataFrame(np.random.randn(7, 3), columns=["A", "B", "C"])

df3 = df + df2
df3

          A         B         C   D
0  0.945416  3.286643  2.263040 NaN
1  1.501678 -0.080585 -0.392092 NaN
2  1.524053 -0.424008 -1.459282 NaN
3 -0.218939  0.350585  0.707898 NaN
4 -2.943569  0.336239 -1.824016 NaN
5 -0.108727 -0.200086 -0.719029 NaN
6 -1.719889  1.462484  2.606881 NaN
7       NaN       NaN       NaN NaN
8       NaN       NaN       NaN NaN
9       NaN       NaN       NaN NaN

In [38]:
#podemos utilizar o dropna caso quisermos aproveitar alguma informação, exclui todas as linhas onde tem algum vazio
del df3["D"]
df3 =df3.dropna()
df3

          A         B         C
0  0.945416  3.286643  2.263040
1  1.501678 -0.080585 -0.392092
2  1.524053 -0.424008 -1.459282
3 -0.218939  0.350585  0.707898
4 -2.943569  0.336239 -1.824016
5 -0.108727 -0.200086 -0.719029
6 -1.719889  1.462484  2.606881

In [39]:
#somando a primeira linha com ela mesmo
df3 + df3.iloc[0]

          A         B         C
0  1.890833  6.573285  4.526080
1  2.447094  3.206058  1.870948
2  2.469469  2.862635  0.803758
3  0.726477  3.637228  2.970939
4 -1.998153  3.622882  0.439024
5  0.836690  3.086557  1.544011
6 -0.774473  4.749126  4.869922

In [44]:
#subtituir as  4 primeiras linhas por 1
#criar array (4,3)
arrayOnes = np.ones(shape = (4,3))
#criar um cópia do dataframe
df4 = df3.copy()
#substituir pelo indice 
df4.iloc[0:4,:] = arrayOnes
df4

          A         B         C
0  1.000000  1.000000  1.000000
1  1.000000  1.000000  1.000000
2  1.000000  1.000000  1.000000
3  1.000000  1.000000  1.000000
4 -2.943569  0.336239 -1.824016
5 -0.108727 -0.200086 -0.719029
6 -1.719889  1.462484  2.606881

Operadores boleanos

In [49]:
dictBool = {"Jogo 1": [0,1,0,1,1], "Jogo 2":[1,0,1,1,1]}

bool_df = pd.DataFrame(dictBool, dtype="bool")

#possivel usar operadores logicos
bool_df["Jogo 3"] = bool_df["Jogo 1"] & bool_df["Jogo 2"]
bool_df["Jogo 4"] = bool_df["Jogo 1"] | bool_df["Jogo 2"]
bool_df

   Jogo 1  Jogo 2  Jogo 3  Jogo 4
0   False    True   False    True
1    True   False   False    True
2   False    True   False    True
3    True    True    True    True
4    True    True    True    True

In [50]:
#inverter seu valor
-bool_df

   Jogo 1  Jogo 2  Jogo 3  Jogo 4
0    True   False    True   False
1   False    True    True   False
2    True   False    True   False
3   False   False   False   False
4   False   False   False   False

Matrix Transposta

In [51]:
bool_df.T

            0      1      2     3     4
Jogo 1  False   True  False  True  True
Jogo 2   True  False   True  True  True
Jogo 3  False  False  False  True  True
Jogo 4   True   True   True  True  True

Função Exponencial  #ligação com o numpy

In [54]:
df_pandas

   A  B   C
0  1  4   7
1  2  5   8
2  3  6   9
3  4  7  10
4  5  8  11

In [68]:
#base e
df_e =np.exp(df_pandas)
df_e

            A            B             C
0    2.718282    54.598150   1096.633158
1    7.389056   148.413159   2980.957987
2   20.085537   403.428793   8103.083928
3   54.598150  1096.633158  22026.465795
4  148.413159  2980.957987  59874.141715

In [69]:
np.around(df_e)

       A       B        C
0    3.0    55.0   1097.0
1    7.0   148.0   2981.0
2   20.0   403.0   8103.0
3   55.0  1097.0  22026.0
4  148.0  2981.0  59874.0